# Strings 
more techniques
Splitting
Stripping
Replacing
Filtering
Combining

https://towardsdatascience.com/5-must-know-pandas-operations-on-strings-4f88ca6b8e25
https://pandas.pydata.org/docs/user_guide/text.html

In [1]:
# Libraries
import numpy as np
import pandas as pd

In [5]:
sample = {
'city':['Lucknow,UP', 'Vasant Vihar,DL', 'Mumbai,MH', 'Chennai,TN', 'Gurugram,HR'],
'salary':['Rs64K-Rs72K', 'Rs62K-Rs70K', 'Rs69K-Rs76K', 'Rs62K-Rs72K', 'Rs71K-Rs78K' ],
'category':['A-B-C-D-E','B-C-D-E-A','C-D-E-A-B','D-E-A-B-C','E-A-B-C-D'],
'class':['  1x', ' 1y', '2x  ', '1x', '1y  '],
'subcategory':['A','B','A','a','c'],
}
df = pd.DataFrame(sample)
df

              city       salary   category class subcategory
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c

## Search

In [6]:
## Search
df['city'].str.contains('L', na=False)

0     True
1     True
2    False
3    False
4    False
Name: city, dtype: bool

In [7]:
## Search
df['city'].str.get_dummies(sep='L')

   Chennai,TN  Gurugram,HR  Mumbai,MH  Vasant Vihar,D  ucknow,UP
0           0            0          0               0          1
1           0            0          0               1          0
2           0            0          1               0          0
3           1            0          0               0          0
4           0            1          0               0          0

In [20]:
list1 = ['Vasant', 'MH', 'Chennai', 'Gurugram,HR']
df[df['city'].isin(list1)] # full match

          city       salary   category class subcategory
4  Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c

In [22]:
df[df['city'].str.lower().isin(['gurugram,hr'])] # full match, ignore case

          city       salary   category class subcategory
4  Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c

In [28]:
df['city'].str.contains('Vasant', case=False, na=False)

0    False
1     True
2    False
3    False
4    False
Name: city, dtype: bool

In [30]:
# special characters  like , ^ (for ^ type \^)
df['city'].str.contains(',', regex=False)

0    True
1    True
2    True
3    True
4    True
Name: city, dtype: bool

In [38]:
pattern1 = 'Vasant|MH|Chennai|Gurugram,HR'
print(pattern1)
mask = df['city'].str.contains(pattern1, case=True, na=False) 
print(mask)
df[mask]

Vasant|MH|Chennai|Gurugram,HR
0    False
1     True
2     True
3     True
4     True
Name: city, dtype: bool

              city       salary   category class subcategory
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c

In [39]:
pattern2 = '[0-9]'
df['salary'].str.contains(pattern2, na=False)

0    True
1    True
2    True
3    True
4    True
Name: salary, dtype: bool

In [44]:
# check in multiple columns
pattern3 = 'TN'
cols_to_check = ['city','class']
print(df[cols_to_check].apply( lambda col:col.str.contains (pattern2, na=False)).all(axis=1))
print(df[cols_to_check].apply( lambda col:col.str.contains (pattern2, na=False)).any(axis=1))

0    False
1    False
2    False
3    False
4    False
dtype: bool
0    True
1    True
2    True
3    True
4    True
dtype: bool

In [46]:
# join
stateAbvn = ['TN','MH','HR']
print(stateAbvn)
statesJoin  = '|'.join(stateAbvn)
print(statesJoin)

['TN', 'MH', 'HR']
TN|MH|HR

In [49]:
df['city'].apply(lambda x: [y for y in stateAbvn if y in x])

0      []
1      []
2    [MH]
3    [TN]
4    [HR]
Name: city, dtype: object

In [50]:
df.assign(indState = df['city'].apply(lambda x: [y for y in stateAbvn if y in x]))

              city       salary   category class subcategory indState
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A       []
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B       []
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A     [MH]
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a     [TN]
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c     [HR]

In [56]:
df.assign(indState = df['city'].str.findall(statesJoin).str[0], flags=re.IGNORECASE)

              city       salary   category class subcategory indState  flags
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A      NaN      2
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B      NaN      2
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A       MH      2
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a       TN      2
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c       HR      2

In [54]:
stateAbvn = ['TN','MH','HR']
df.city.str.findall('|'.join(stateAbvn)).str[0]
#df.assign(indState = df['city'].str.findall(statesJoin))

0    NaN
1    NaN
2     MH
3     TN
4     HR
Name: city, dtype: object

In [62]:
#df.city.str.extractall(f'({"|".join(stateAbvn)}'), flags=re.IGNORECASE) #.str[0]  #error

SyntaxError: cannot assign to function call (142772846.py, line 1)

### Regular Expression (regex)
re
re.search() - partial, forward, backward
re.match() - fwd
^ - begin ; $end
[A-Z]- any one letter of upper case ; [A-Z]+ - any substring 1 or more consecutive uppercase 
[a-z]

In [18]:
import re
a = 'Chennai,TN' # it should be string only
print(re.search('TN', a))
print(re.match('TN', a))
print(re.match('[A-Z]', a))
print(re.match('[A-Z]+', a))

<re.Match object; span=(8, 10), match='TN'>
None
<re.Match object; span=(0, 1), match='C'>
<re.Match object; span=(0, 1), match='C'>

# 1- Splitting
Sometimes strings carry more than one piece of information and we may need to use them separately. For instance, city contains both city and state. The split function of pandas is a highly flexible function to split strings.

In [32]:
df_sample['city'].str.split(',')
#each element is converted to a list based on the character used for splitting. 
#We can easily export individual elements from those lists. Let’s create a “state” column.

0         [Lucknow, UP]
1    [Vasant Vihar, DL]
2          [Mumbai, MH]
3         [Chennai, TN]
4        [Gurugram, HR]
Name: city, dtype: object

In [33]:
df_sample['state'] = df_sample['city'].str.split(',').str[1]
df_sample
#Subscript ([1]) must be applied with str keyword.

              city       salary   category class subcategory state
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A    UP
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B    DL
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A    MH
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a    TN
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c    HR

In [34]:
#Otherwise, we will get the list in the specified row.
df_sample['city'].str.split(',')[1]

['Vasant Vihar', 'DL']

In [35]:
#The splitting can be done on any character or letter.
#The split function returns a dataframe if expand parameter is set as True.
df_sample['city'].str.split(',', expand=True)

              0   1
0       Lucknow  UP
1  Vasant Vihar  DL
2        Mumbai  MH
3       Chennai  TN
4      Gurugram  HR

### split vs rsplit
By default, splitting is done from the left. To do splitting on the right, use rsplit.

In [36]:
df_sample.category.str.split('-', expand=True, n=2) # left side
#only 2 splits on the left are performed. If we do the same operation with rsplit:

   0  1      2
0  A  B  C-D-E
1  B  C  D-E-A
2  C  D  E-A-B
3  D  E  A-B-C
4  E  A  B-C-D

In [37]:
df_sample.category.str.rsplit('-', expand=True, n=2)  # Right side

       0  1  2
0  A-B-C  D  E
1  B-C-D  E  A
2  C-D-E  A  B
3  D-E-A  B  C
4  E-A-B  C  D

# 2. Stripping
Stripping is like trimming tree branches. We can remove spaces or any other characters at the beginning or end of a string.

In [38]:
df_sample

              city       salary   category class subcategory state
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A    UP
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B    DL
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A    MH
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a    TN
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c    HR

In [39]:
#For instance, the strings in 'salary' has 
#Rs character at the beginning which can be removed with lstrip:
df_sample['salary'].str.lstrip('Rs')

0    64K-Rs72K
1    62K-Rs70K
2    69K-Rs76K
3    62K-Rs72K
4    71K-Rs78K
Name: salary, dtype: object

In [40]:
#Similary, rstrip is used to trim off characters from the end.; remove K
df_sample['salary'].str.rstrip('K')

0    Rs64K-Rs72
1    Rs62K-Rs70
2    Rs69K-Rs76
3    Rs62K-Rs72
4    Rs71K-Rs78
Name: salary, dtype: object

In [41]:
# leading and trailing spaces
print(df_sample['class'])

0      1x
1      1y
2    2x
3      1x
4    1y
Name: class, dtype: object

In [42]:
#df_sample['class'] = df_sample['class'].str.strip()  # remove spaces
df_sample['class'].str.strip()  # remove spaces
#print(df_sample['class'])
#print(df_sample)

0    1x
1    1y
2    2x
3    1x
4    1y
Name: class, dtype: object

## 3 - Replacing
Pandas replace function is used to replace values in rows or columns. Similarly, replace as a string operation is used to replace characters in a string.

In [43]:
#Let’s replace “x” letters in “class” with “z”.
df_sample['class'].str.replace('x', 'z')
#df_sample['class'] = df_sample['class'].str.replace('x', 'z')

0      1z
1      1y
2    2z
3      1z
4    1y
Name: class, dtype: object

In [44]:
#Let’s replace “Rs” letters in “salary” with “$”.
df_sample['salary'].str.replace('Rs', '$')

0    $64K-$72K
1    $62K-$70K
2    $69K-$76K
3    $62K-$72K
4    $71K-$78K
Name: salary, dtype: object

In [72]:
df_sample['city'].str.replace('^L|V', 'XX', case=False, regex=True)
#text starting with L or V, replace by XX

0          XXucknow,UP
1    XXasant XXihar,DL
2            Mumbai,MH
3           Chennai,TN
4          Gurugram,HR
Name: city, dtype: object

In [73]:
df_sample['salary'].str.removeprefix('Rs')  #remove prefix

0    64K-Rs72K
1    62K-Rs70K
2    69K-Rs76K
3    62K-Rs72K
4    71K-Rs78K
Name: salary, dtype: object

In [74]:
df_sample['salary'].str.removesuffix('K')  #remove suffix

0    Rs64K-Rs72
1    Rs62K-Rs70
2    Rs69K-Rs76
3    Rs62K-Rs72
4    Rs71K-Rs78
Name: salary, dtype: object

## 4. Filtering
We can filter strings based on the first and last characters. The functions to use are startswith() and endswith()

In [45]:
df_sample

              city       salary   category class subcategory state
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A    UP
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B    DL
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A    MH
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a    TN
4      Gurugram,HR  Rs71K-Rs78K  E-A-B-C-D  1y             c    HR

In [46]:
df_sample[df_sample['city'].str.endswith('P')]

         city       salary   category class subcategory state
0  Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A    UP

In [47]:
#Or, rows in which “salary” starts with “Rs6”
df_sample[df_sample['salary'].str.startswith('Rs6')]

              city       salary   category class subcategory state
0       Lucknow,UP  Rs64K-Rs72K  A-B-C-D-E    1x           A    UP
1  Vasant Vihar,DL  Rs62K-Rs70K  B-C-D-E-A    1y           B    DL
2        Mumbai,MH  Rs69K-Rs76K  C-D-E-A-B  2x             A    MH
3       Chennai,TN  Rs62K-Rs72K  D-E-A-B-C    1x           a    TN

In [50]:
#We can also filter strings by extracting certain characters. For instace, we can get the first 2 character of strings 
#in a column or series by str[:2].
# salary represents a value range but numerical values are hidden in a string. 
#Let’s extract them with string subscripts:
df_sample['salary']

0    Rs64K-Rs72K
1    Rs62K-Rs70K
2    Rs69K-Rs76K
3    Rs62K-Rs72K
4    Rs71K-Rs78K
Name: salary, dtype: object

In [53]:
lowerValue  = df_sample['salary'].str[2:4]
print(lowerValue)

0    64
1    62
2    69
3    62
4    71
Name: salary, dtype: object

In [54]:
upperValue  = df_sample['salary'].str[-3:-1]
print(upperValue)

0    72
1    70
2    76
3    72
4    78
Name: salary, dtype: object

## 5 - Combining
Cat function can be used to concatenate strings.
We need pass an argument to put between concatenated strings using sep parameter. By default, cat ignores missing values but we can also specify how to handle them using na_rep parameter.
Let’s create a new column by concatenating “col_c” and “col_d” with “-” separator.

In [56]:
df_sample['new']=df_sample['category'].str.cat(df_sample['state'], sep='-')
df_sample

,city,salary,category,class,subcategory,state,new
0,"Lucknow,UP",Rs64K-Rs72K,A-B-C-D-E,1x,A,UP,A-B-C-D-E-UP
1,"Vasant Vihar,DL",Rs62K-Rs70K,B-C-D-E-A,1y,B,DL,B-C-D-E-A-DL
2,"Mumbai,MH",Rs69K-Rs76K,C-D-E-A-B,2x,A,MH,C-D-E-A-B-MH
3,"Chennai,TN",Rs62K-Rs72K,D-E-A-B-C,1x,a,TN,D-E-A-B-C-TN
4,"Gurugram,HR",Rs71K-Rs78K,E-A-B-C-D,1y,c,HR,E-A-B-C-D-HR

In [76]:
df_sample['city'].str.cat(sep='; ')

'Lucknow,UP; Vasant Vihar,DL; Mumbai,MH; Chennai,TN; Gurugram,HR'

In [78]:
df_sample['city'].str.cat(sep='', na_rep='-') # if na values show -

'Lucknow,UPVasant Vihar,DLMumbai,MHChennai,TNGurugram,HR'

In [83]:
### Join Series
team1 = pd.Series(['India', 'Pakistan','Bangladesh', np.nan])
team2 = pd.Series(['Australia', 'England','New Zealand', 'Afghanisatan'])
pd.concat([team1, team2], axis=1)

            0             1
0       India     Australia
1    Pakistan       England
2  Bangladesh   New Zealand
3         NaN  Afghanisatan

In [85]:
team1.str.cat(team2, na_rep='-')

0           IndiaAustralia
1          PakistanEngland
2    BangladeshNew Zealand
3            -Afghanisatan
dtype: object

## Removing

In [95]:
cityNames = pd.Series(['Delhi 11001','Mumbai #', 'Kolkatta ??'])
print(cityNames)

0    Delhi 11001
1       Mumbai #
2    Kolkatta ??
dtype: object

In [90]:
cityNames.str.extract(r"([ab])", expand=False)
# elements that do not match return a row filled with NAN

0    NaN
1      b
2      a
dtype: object

In [112]:
pattern = r"[a-z] [0-9]"  #not space
cityNames.str.contains(pattern)

0     True
1    False
2    False
dtype: bool

In [117]:
#pattern = r"[a-z][a-z] #" 
#cityNames.str.match(pattern)

0    False
1    False
2    False
dtype: bool

In [114]:
#cityNames.str.fullmatch(pattern)

0    False
1    False
2    False
dtype: bool

## Object vs String
Before pandas 1.0, only “object” datatype was used to store strings which cause some drawbacks because non-string data can also be stored using “object” datatype. Pandas 1.0 introduces a new datatype specific to string data which is StringDtype. As of now, we can still use object or StringDtype to store strings but in the future, we may be required to only use StringDtype.

One important thing to note here is that object datatype is still the default datatype for strings. To use StringDtype, we need to explicitly state it.

We can pass “string” or pd.StringDtype() argument to dtype parameter to string datatype.

In [62]:
city1 = pd.Series(['Delhi','Mumbai', 'Kolkatta'])
print(city1, '\n', city1.dtype)

0       Delhi
1      Mumbai
2    Kolkatta
dtype: object
 object

In [63]:
city2 = pd.Series(['Chennai', "Bangalore", 'Pune'], dtype='string')
print(city2, '\n', city2.dtype)
# dtype = pd.StringDtype()
city1.astype('string')

0      Chennai
1    Bangalore
2         Pune
dtype: string
 string

0       Delhi
1      Mumbai
2    Kolkatta
dtype: string

In [66]:
city2.str.match('P')

0    False
1    False
2     True
dtype: boolean

In [69]:
print(city2.str.len(), '\n', city1.str.len())

0    7
1    9
2    4
dtype: Int64
 0    5
1    6
2    8
dtype: int64